In [8]:
import pandas as pd

In [10]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mippk\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mippk\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [14]:
s=[1,2,3,4,5]
d=pd.Series(s)

In [20]:
s

[1, 2, 3, 4, 5]

In [23]:
d

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
x=pd.Series(s,index=['a','b','c','d','e'])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [31]:
a=['banana','apple','kiwi','mango']
b=pd.Series(a)
a

['banana', 'apple', 'kiwi', 'mango']

In [33]:
b

0    banana
1     apple
2      kiwi
3     mango
dtype: object

In [39]:
c=pd.Series(a,index=[1,2,3,4])
c

1    banana
2     apple
3      kiwi
4     mango
dtype: object

In [41]:
b[2]#

'kiwi'

In [45]:
b[3]

'mango'

In [47]:
b[1:2]

1    apple
dtype: object

In [49]:
b[1:3]#slicing

1    apple
2     kiwi
dtype: object

In [63]:
x=[1,2,3,4,5,6,7]
y=pd.Series(x)
x
y

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [65]:
y[4]

5

In [95]:
y[5]
z=pd.Series(x,index=["a","b","c","d","e","f","g"])
z

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [97]:
y[2:5]

2    3
3    4
4    5
dtype: int64

In [99]:
z

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [103]:
z['b':'f']

b    2
c    3
d    4
e    5
f    6
dtype: int64

 vectorised operations

In [112]:
h=[1,2,3,4,5]
e=pd.Series(h)
e

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [114]:
s=e+2

In [116]:
s

0    3
1    4
2    5
3    6
4    7
dtype: int64

ELEMENT WISE OPERATORS:

In [141]:
a=pd.Series([1,2,3,4,5,6,7])
b=pd.Series([2,5,3,8,2,1,6])
a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [143]:
b

0    2
1    5
2    3
3    8
4    2
5    1
6    6
dtype: int64

In [145]:
c=a+b
c

0     3
1     7
2     6
3    12
4     7
5     7
6    13
dtype: int64

In [147]:
sub=a-b
sub

0   -1
1   -3
2    0
3   -4
4    3
5    5
6    1
dtype: int64

In [151]:
mul=a*b
mul

0     2
1    10
2     9
3    32
4    10
5     6
6    42
dtype: int64

In [153]:
d=a.add(b)
d

0     3
1     7
2     6
3    12
4     7
5     7
6    13
dtype: int64

In [155]:
d=a.sub(b)
d

0   -1
1   -3
2    0
3   -4
4    3
5    5
6    1
dtype: int64

In [157]:
d.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [161]:
d.isnull().sum()

0

In [163]:
d.isna()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [165]:
d.isna().sum()

0

In [167]:
d.dropna()

0   -1
1   -3
2    0
3   -4
4    3
5    5
6    1
dtype: int64

In [1]:
import pandas as pan

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mippk\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mippk\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mippk\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
a=[19,2,3,4,5,6,78]
b=pan.Series(a)
b

0    19
1     2
2     3
3     4
4     5
5     6
6    78
dtype: int64

In [31]:
fruits=["banana","cherry","kiwi","apple","orange","mango"]
a=pan.Series(fruits)
a

0    banana
1    cherry
2      kiwi
3     apple
4    orange
5     mango
dtype: object

In [33]:
c=pan.Series(fruits,index=['a','b','c','d','e','f'])
c

a    banana
b    cherry
c      kiwi
d     apple
e    orange
f     mango
dtype: object

In [37]:
c[2]
c[1:5]

C:\Users\mippk\AppData\Local\Temp\ipykernel_21004\3726417493.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  c[2]

b    cherry
c      kiwi
d     apple
e    orange
dtype: object

In [39]:
a=[1,2,3,4,5,6,7,8,9]
b=pan.Series(a)
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [43]:
c=b+2
c
c=b*2
c

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
dtype: int64

In [49]:
a=pan.Series([1,2,3,4,5,6,7,8,9])
b=pan.Series([11,12,13,14,15,16])
a
b

0    11
1    12
2    13
3    14
4    15
5    16
dtype: int64

In [51]:
a

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [57]:
c=a+b
c

0    12.0
1    14.0
2    16.0
3    18.0
4    20.0
5    22.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [59]:
d=a.add(b)
d

0    12.0
1    14.0
2    16.0
3    18.0
4    20.0
5    22.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [61]:
f=a.sub(b)
f

0   -10.0
1   -10.0
2   -10.0
3   -10.0
4   -10.0
5   -10.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [63]:
g=a.mul(b)
g

0    11.0
1    24.0
2    39.0
3    56.0
4    75.0
5    96.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [65]:
b.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

# CREATING DIFFERENTTYPE OF DATA

## Csv FILE

In [84]:
#creating a sample dataset
data={
    'name':['aby','boby','john','kevin','rony'],
    'age':[23,56,64,35,32,],
    'department':['HR','finance','marketing','IT','admin'],
    'salary':[10000,20000,30000,40000,50000]
}
#covert the data into a DataFrame
df=pan.DataFrame(data)
df
#save the DataFrame to a Csv file 
df.to_csv('sample_file.csv',index=False)
#open a csv file in read only mode
read=pan.read_csv('sample_file.csv')

    name  age department  salary
0    aby   23         HR   10000
1   boby   56    finance   20000
2   john   64  marketing   30000
3  kevin   35         IT   40000
4   rony   32      admin   50000

## EXCEL FILE

In [90]:
#creating a sample dataset
data={
    'name':['aby','boby','john','kevin','rony'],
    'age':[23,56,64,35,32,],
    'department':['HR','finance','marketing','IT','admin'],
    'salary':[10000,20000,30000,40000,50000]
}
#covert the data into a DataFrame
df=pan.DataFrame(data)
df
#save the DataFrame to a excel file 
df.to_excel('sample_file.xlsx',index=False)
#open a excel file in read only mode
read=pan.read_excel('sample_file.xlsx')
read

    name  age department  salary
0    aby   23         HR   10000
1   boby   56    finance   20000
2   john   64  marketing   30000
3  kevin   35         IT   40000
4   rony   32      admin   50000

## HTML

In [95]:
#creating a sample dataset
data={
    'name':['aby','boby','john','kevin','rony'],
    'age':[23,56,64,35,32,],
    'department':['HR','finance','marketing','IT','admin'],
    'salary':[10000,20000,30000,40000,50000]
}
#covert the data into a DataFrame
df=pan.DataFrame(data)
df
#save the DataFrame to a html file 
df.to_html('sample_file.html',index=False)
#open a html file in read only mode
read=pan.read_html('sample_file.html')
read

[    name  age department  salary
 0    aby   23         HR   10000
 1   boby   56    finance   20000
 2   john   64  marketing   30000
 3  kevin   35         IT   40000
 4   rony   32      admin   50000]

## txt file

In [102]:
#creating a sample dataset
data={
    'name':['aby','boby','john','kevin','rony'],
    'age':[23,56,64,35,32,],
    'department':['HR','finance','marketing','IT','admin'],
    'salary':[10000,20000,30000,40000,50000]
}
#covert the data into a DataFrame
df=pan.DataFrame(data)
df
#save the DataFrame to a txt file 
df.to_csv('sample_file.txt',sep='\t', index=False)
#open a txt file in read only mode
read=pan.read_table('sample_file.txt')
read

    name  age department  salary
0    aby   23         HR   10000
1   boby   56    finance   20000
2   john   64  marketing   30000
3  kevin   35         IT   40000
4   rony   32      admin   50000

## pickle file

In [106]:
import pickle
#creating a sample dataset
data={
    'name':['aby','boby','john','kevin','rony'],
    'age':[23,56,64,35,32,],
    'department':['HR','finance','marketing','IT','admin'],
    'salary':[10000,20000,30000,40000,50000]
}
#covert the data into a DataFrame
df=pan.DataFrame(data)
df
#save the DataFrame to a pickle file 
with open('sample_file.pkl','wb')as file:
#wb means write binary
    pickle.dump(data,file)
#open a txt file in read only mode
read=pan.read_pickle('sample_file.pkl')
read

{'name': ['aby', 'boby', 'john', 'kevin', 'rony'],
 'age': [23, 56, 64, 35, 32],
 'department': ['HR', 'finance', 'marketing', 'IT', 'admin'],
 'salary': [10000, 20000, 30000, 40000, 50000]}

# Data frame creation
## from a list of Dictionary

In [116]:
data=[
    {'name':'aby','age':25,'city':'canada'},
    {'name':'boby','age':45,'city':'chicagi'},
    {'name':'john','age':41,'city':'losangels'}
]
df=pan.DataFrame(data)
df

   name  age       city
0   aby   25     canada
1  boby   45    chicagi
2  john   41  losangels

## from a list of list

In [129]:
data=[
    ['alice',30,'malappuram'],
    ['boby',24,'koxhikode'],
    ['tom',30,'kannur']
]
df=pan.DataFrame(data,columns=['name','age','city'])
df

    name  age        city
0  alice   30  malappuram
1   boby   24   koxhikode
2    tom   30      kannur